---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSeparator
source: html/5bbed76e-f811-b98b-288a-6f74aa2b0f2c.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSeparator Property

The rectangular duct size separator string.

## Syntax (C#)
```csharp
public string RectangularDuctSizeSeparator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null